---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetRunGeometries
source: html/26070436-3acd-9844-eb45-f40d67116408.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetRunGeometries Method

Gets the geometries of runs.

## Syntax (C#)
```csharp
public IList<IList<GeometryObject>> GetRunGeometries()
```

## Returns
The geometries of runs.